Repository: OwOHamper/Flask-Starter-Kit
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, it, zh

source: Under Construction
de: In Bearbeitung
it: In costruzione
zh: 建設中

# under_construction_description
source: Crafting a powerful Flask Starter Kit to revolutionize your web development â€“ coming soon!
de: Wir entwickeln ein schlankes, effizientes Flask Starter Kit, um Ihre Webentwicklung zu beschleunigen - bald verfügbar!
it: Stiamo costruendo un Kit di Avvio Flask elegante ed efficiente per potenziare il vostro sviluppo web - presto disponibile!
zh: 正在打造一個時尚高效的 Flask 入門套件，以提升您的網頁開發效率 - 即將推出！

# keywords
source: Full-Stack Flask Starter Kit, web development tool, Flask projects, Python web framework, Flask features, web application development, Flask starter template, Flask boilerplate, Python web development, Flask project structure, OAuth authentication, MongoDB integration
de: Full-Stack Flask Starter Kit, Webentwicklungstool, Flask-Projekte, Python-Webframework, Flask-Funktionen, Webanwendungsentwicklung, Flask-Startervorlage, Flask-Boilerplate, Python-Webentwicklung, Flask-Projektstruktur
it: Kit di avvio Flask full-stack, strumento di sviluppo web, progetti Flask, framework web Python, funzionalità Flask, sviluppo di applicazioni web, modello di avvio Flask, boilerplate Flask, sviluppo web Python, struttura del progetto Flask
zh: 全棧Flask起始套件, 網頁開發工具, Flask專案, Python網頁框架, Flask功能, 網頁應用程式開發, Flask起始模板, Flask樣板, Python網頁開發, Flask專案結構

source: Open main menu
de: Hauptmenü öffnen
it: Apri menu principale
zh: 打開主選單

source: About
de: Über uns
it: Chi siamo
zh: 關於我們

source: Documentation
de: Dokumentation
it: Documentazione
zh: 文檔

source: Contact
de: Kontakt
it: Contatti
zh: 聯繫我們

source: Privacy Policy
de: Datenschutzerklärung
it: Informativa sulla privacy
zh: 隱私政策

source: Terms and Conditions
de: Allgemeine Geschäftsbedingungen
it: Termini e condizioni
zh: 條款和條件

source: All Rights Reserved.
de: Alle Rechte vorbehalten.
it: Tutti i diritti riservati.
zh: 版權所有。

# 401_unauthorized_title
source: 401 Unauthorized Access
it: 401 Accesso non autorizzato

# 401_unauthorized_message
source: Access Denied
it: Accesso negato.

# 401_error_description
source: Sorry, you don't have permission to access this page. Please log in or contact the administrator if you believe this is an error.
it: Spiacenti, non hai il permesso di accedere a questa pagina. Per favore, accedi o contatta l'amministratore se ritieni che questo sia un errore.

source: Go to Login
it: Vai al login

# 404_not_found_title
source: 404 Page Not Found
de: 404 Seite nicht gefunden
it: 404 Pagina non trovata
zh: 404 網頁未找到

# something_is_missing
source: Oops! Something's missing.
de: Etwas fehlt.
it: Qualcosa manca.
zh: 有些東西不見了。

# 404_error_description
source: We're sorry, but we can't find the page you're looking for. Let's get you back on track with our homepage.
de: Entschuldigung, wir können diese Seite nicht finden. Auf der Startseite gibt es viel zu entdecken.
it: Ci dispiace, non riusciamo a trovare quella pagina. Troverai molto da esplorare sulla homepage.
zh: 歉，我們找不到該頁面。您可以在首頁上找到許多值得探索的內容。

source: Back to Homepage
de: Zurück zur Startseite
it: Torna alla Homepage
zh: 返回首頁

# about_title
source: About Full-Stack Flask Starter Kit
de: Über uns
it: Chi siamo
zh: 關於我們

# about_description
source: Discover the Full-Stack Flask Starter Kit, a comprehensive solution designed to streamline your Flask projects. Learn about our powerful features, including OAuth authentication, MongoDB integration, and modern UI design.
de: Erfahren Sie mehr über das Full-Stack Flask Starter Kit, seine Funktionen und das Team hinter diesem leistungsstarken Webentwicklungstool, das entwickelt wurde, um Ihre Flask-Projekte zu optimieren.
it: Scopri il Full-Stack Flask Starter Kit, le sue caratteristiche e il team dietro questo potente strumento di sviluppo web progettato per ottimizzare i tuoi progetti Flask.
zh: 了解全棧 Flask 入門套件、其功能以及這個強大的網頁開發工具背後的團隊，該工具旨在簡化您的 Flask 專案。

# contact_title
source: Contact Us
de: Kontakt
it: Contatti
zh: 聯繫我們

# contact_description
source: Have questions or feedback? Get in touch with the Flask Starter Kit team. We're here to support your development journey and help you make the most of our toolkit.
de: Nehmen Sie Kontakt mit dem Flask Starter Kit-Team auf. Wir sind hier, um Ihnen bei Fragen, Feedback oder Unterstützungsbedarf zu helfen.
it: Mettiti in contatto con il team di Flask Starter Kit. Siamo qui per aiutarti con le tue domande, feedback o esigenze di supporto.
zh: 與 Flask 入門套件團隊聯繫。我們在此為您解答問題、聽取反饋或提供支援。

# documentation_title
source: Documentation
de: Dokumentation
it: Documentazione
zh: 文檔

# documentation_description
source: Comprehensive guides for the Full-Stack Flask Starter Kit. From initial setup to advanced features like OAuth integration and MongoDB usage, find all the information you need to maximize your Flask development.
de: Umfassende Anleitungen für das Full-Stack Flask Starter Kit. Von der Einrichtung bis zu fortgeschrittenen Funktionen finden Sie hier alle Informationen, die Sie benötigen, um Ihre Flask-Entwicklung zu maximieren.
it: Guide complete per il Full-Stack Flask Starter Kit. Dalla configurazione alle funzionalità avanzate, trova tutte le informazioni necessarie per massimizzare il tuo sviluppo Flask.
zh: 全棧 Flask 入門套件的全面指南。從設置到高級功能，找到您需要的所有資訊以最大化您的 Flask 開發。

# explore_title
source: Explore Our Features
it: Flask Starter Kit

# explore_description
source: Discover the Full-Stack Flask Starter Kit's extensive capabilities. From OAuth authentication to MongoDB integration, explore our powerful web development tools designed to accelerate your Flask projects. Whether you're building a small application or a complex web service, we've got you covered.
it: Lancia rapidamente le tue applicazioni web con il Full-Stack Flask Starter Kit.

# home_title
source: Full-Stack Flask Starter Kit
de: Flask Starter Kit
it: Flask Starter Kit
zh: Flask 入門套件

# home_description
source: Jumpstart your web applications with the Full-Stack Flask Starter Kit. Featuring OAuth authentication, MongoDB integration, and modern UI design for seamless development and deployment.
de: Starten Sie Ihre Webanwendungen schnell mit dem Full-Stack Flask Starter Kit.
it: Lancia rapidamente le tue applicazioni web con il Full-Stack Flask Starter Kit.
zh: 使用全棧 Flask 入門套件快速啟動您的網頁應用程式。

# home_hero_description
source: Accelerate your web development with our comprehensive Flask Starter Kit. Enjoy seamless OAuth authentication, MongoDB integration, and a modern UI design powered by Tailwind CSS and Flowbite.
de: Starten Sie Ihre Webanwendungen schnell mit dem Full-Stack Flask Starter Kit. Optimierte Einrichtung für nahtlose Entwicklung und Bereitstellung.
it: Lancia rapidamente le tue applicazioni web con il Full-Stack Flask Starter Kit. Configurazione ottimizzata per uno sviluppo e una distribuzione senza intoppi.
zh: 使用全棧 Flask 入門套件快速啟動您的網頁應用程式。簡化設置以實現無縫開發和部署。

# see_features
source: Explore Features
de: Funktionen ansehen
it: Vedi le caratteristiche
zh: 查看功能

source: View on GitHub
de: Auf GitHub ansehen
it: Visualizza su GitHub
zh: 在 GitHub 上查看

# key_features
source: ðŸŒŸ Key Features
de: 🌟 Hauptfunktionen
it: 🌟 Caratteristiche principali
zh: 🌟 主要功能

# feature_section_subtitle
source: Empowering your web development with a comprehensive, modern toolkit.
de: Stärken Sie Ihre Webentwicklung mit einem sorgfältig gestalteten Toolkit.
it: Potenzia il tuo sviluppo web con un toolkit accuratamente progettato.
zh: 通過精心設計的工具組強化您的網頁開發。

# feature_1_title
source: Easy Deployment
de: Einfache Bereitstellung
it: Distribuzione facile
zh: 輕鬆部署

# feature_1_description
source: Pre-configured Docker setup for straightforward deployment, getting your application up and running quickly in any environment.
de: Vorkonfiguriertes Docker-Setup für unkomplizierte Bereitstellung, um Ihre Anwendung schnell zum Laufen zu bringen.
it: Configurazione Docker preimpostata per una distribuzione semplice, che permette di avviare rapidamente la tua applicazione.
zh: 預配置的 Docker 設置，便於直接部署，讓您的應用程式快速運行。

# feature_2_title
source: Advanced Authentication
de: Modernes Design
it: Design moderno
zh: 現代設計

# feature_2_description
source: Robust OAuth 2.0 support with email verification, password reset, and account linking for secure and flexible user management.
de: Nutzung von Tailwind CSS und der Flowbite UI-Bibliothek für eine schlanke, responsive Benutzeroberfläche, die leicht anpassbar ist.
it: Utilizzo di Tailwind CSS e della libreria UI Flowbite per un'interfaccia elegante e reattiva, facile da personalizzare.
zh: 利用 Tailwind CSS 和 Flowbite UI 庫實現時尚、響應式的界面，易於自定義。

# feature_3_title
source: MongoDB Integration
de: Sicherheit & Optimierung
it: Sicurezza e ottimizzazione
zh: 安全性和優化

# feature_3_description
source: Seamless integration with MongoDB for scalable and flexible data management, perfect for modern web applications.
de: Integrierte Sicherheitsmaßnahmen und Leistungsoptimierungen, um Ihre Anwendung sicher und schnell zu halten.
it: Misure di sicurezza integrate e ottimizzazioni delle prestazioni per mantenere la tua applicazione sicura e veloce.
zh: 內置安全措施和性能優化，確保您的應用程式安全且快速。

# feature_4_title
source: Modern UI Design
de: Internationalisierung
it: Internazionalizzazione
zh: 國際化

# feature_4_description
source: Leveraging Tailwind CSS and Flowbite UI library for a sleek, responsive interface with built-in light/dark mode support.
de: Babel-Integration für nahtlose Mehrsprachenunterstützung, wodurch Ihre App für ein globales Publikum zugänglich wird.
it: Integrazione di Babel per un supporto multilingue senza soluzione di continuità, rendendo la tua app accessibile a un pubblico globale.
zh: Babel 集成實現無縫多語言支持，使您的應用程式面向全球受眾。

# feature_5_title
source: Internationalization
de: Komfort
it: Convenienza
zh: 便利性

# feature_5_description
source: Babel integration for seamless multi-language support, making your app accessible to a global audience with ease.
de: Ohne Perfektion zu beanspruchen, ist dieser Technologie-Stack darauf ausgelegt, die Produktivität und Zufriedenheit der Entwickler zu steigern.
it: Senza pretendere la perfezione, questo stack tecnologico è progettato per migliorare la produttività e la soddisfazione degli sviluppatori.
zh: 雖不宣稱完美，但這個技術堆棧旨在提高開發人員的生產力和滿意度。

# feature_6_title
source: Comprehensive Toolset
de: Umfassendes Toolset
it: Set di strumenti completo
zh: 全面的工具集

# feature_6_description
source: From SEO support to analytics integration, rate limiting to response optimization - a robust set of features to supercharge your project.
de: Von Themenwechsel bis Ratenbegrenzung, SEO-Unterstützung bis zur Analytik-Integration - ein robuster Satz an Funktionen, um Ihr Projekt in Gang zu bringen.
it: Dal cambio di tema alla limitazione della frequenza, dal supporto SEO all'integrazione dell'analisi - un set robusto di funzionalità per avviare il tuo progetto.
zh: 從主題切換到速率限制，從 SEO 支持到分析集成 - 一套強大的功能集以啟動您的項目。

# FAQ
source: Frequently Asked Questions
de: Häufig gestellte Fragen
it: Domande frequenti
zh: 常見問題

# question_1
source: What is the Full-Stack Flask Starter Kit?
de: Was ist das Full-Stack Flask Starter Kit?
it: Cos'è il Full-Stack Flask Starter Kit?
zh: 什麼是全棧 Flask 入門套件？

# answer_1
source: A comprehensive starting point for Flask-based web applications, featuring OAuth authentication, MongoDB integration, modern design tools, and developer-friendly features for rapid development and deployment.
de: Ein umfassender Ausgangspunkt für Flask-basierte Webanwendungen, mit modernen Design-Tools, Bereitstellungskonfigurationen und entwicklerfreundlichen Funktionen.
it: Un punto di partenza completo per applicazioni web basate su Flask, con strumenti di design moderni, configurazioni di distribuzione e funzionalità facili da usare per gli sviluppatori.
zh: 一個全面的 Flask 網頁應用起點，具有現代設計工具、部署配置和開發者友好功能。

# question_2
source: Who is this starter kit for?
de: Für wen ist dieses Starter Kit gedacht?
it: A chi è destinato questo starter kit?
zh: 這個入門套件適合誰？

# answer_2
source: Developers looking for a robust Flask foundation with integrated modern frontend tools, OAuth authentication, MongoDB support, and efficient deployment solutions.
de: Entwickler, die nach einer robusten Flask-Grundlage mit integrierten modernen Frontend-Tools und Bereitstellungslösungen suchen.
it: Agli sviluppatori che cercano una solida base Flask con strumenti frontend moderni integrati e soluzioni di distribuzione.
zh: 尋找具有集成現代前端工具和部署解決方案的穩健 Flask 基礎的開發人員。

# question_3
source: What technologies does this kit use?
de: Welche Technologien verwendet dieses Kit?
it: Quali tecnologie utilizza questo kit?
zh: 這個套件使用哪些技術？

# answer_3
source: Flask, OAuth 2.0, MongoDB, Tailwind CSS, Flowbite, Docker, Babel, and more for a comprehensive full-stack development experience.
de: Flask, Tailwind CSS, Flowbite, Docker, MongoDB, Babel und mehr.
it: Flask, Tailwind CSS, Flowbite, Docker, MongoDB, Babel e altro ancora.
zh: Flask、Tailwind CSS、Flowbite、Docker、MongoDB、Babel 等。

# question_4
source: Is this kit suitable for beginners?
de: Ist dieses Kit für Anfänger geeignet?
it: Questo kit è adatto ai principianti?
zh: 這個套件適合初學者嗎？

# answer_4
source: While some Flask experience is beneficial, our extensive documentation aims to guide developers of various skill levels through setup and usage.
de: Während einige Flask-Erfahrungen von Vorteil sind, zielt unsere Dokumentation darauf ab, Entwickler verschiedener Fähigkeitsstufen anzuleiten.
it: Sebbene un'esperienza con Flask sia vantaggiosa, la nostra documentazione mira a guidare gli sviluppatori di vari livelli di competenza.
zh: 雖然有一些 Flask 經驗會有幫助，但我們的文檔旨在指導各種技能水平的開發人員。

# question_5
source: How does the OAuth authentication work?
de: Wie funktioniert das Docker-Setup?
it: Come funziona la configurazione Docker?
zh: Docker 設置如何運作？

# answer_5
source: Our kit includes a pre-configured OAuth 2.0 setup, supporting various providers for easy and secure user authentication and authorization.
de: Unser Kit enthält ein vorkonfiguriertes Docker-Setup für einfache Entwicklung und Bereitstellung in verschiedenen Umgebungen.
it: Il nostro kit include una configurazione Docker preimpostata per uno sviluppo e una distribuzione facili in diversi ambienti.
zh: 我們的套件包含預配置的 Docker 設置，便於在不同環境中進行開發和部署。

# question_6
source: Can I use this for commercial projects?
de: Kann ich dies für kommerzielle Projekte verwenden?
it: Posso utilizzarlo per progetti commerciali?
zh: 我可以將其用於商業項目嗎？

# answer_6
source: Yes, this starter kit is open-source and can be used for both personal and commercial projects. Please check the license for specific details.
de: Ja, dieses Starter Kit ist Open-Source und kann sowohl für persönliche als auch für kommerzielle Projekte verwendet werden. Bitte überprüfen Sie die Lizenz für Details.
it: Sì, questo starter kit è open-source e può essere utilizzato sia per progetti personali che commerciali. Si prega di controllare la licenza per i dettagli.
zh: 是的，這個入門套件是開源的，可用於個人和商業項目。請查看許可證以了解詳情。

# question_7
source: How can I contribute to this project?
de: Wie kann ich zu diesem Projekt beitragen?
it: Come posso contribuire a questo progetto?
zh: 我如何為這個項目做出貢獻？

# answer_7
source: We welcome contributions! Check our GitHub repository for contribution guidelines, open issues, and ways to get involved in improving the kit.
de: Wir begrüßen Beiträge! Überprüfen Sie unser GitHub-Repository für Richtlinien zur Mitarbeit und offene Issues.
it: Accogliamo con favore i contributi! Controlla il nostro repository GitHub per le linee guida sui contributi e i problemi aperti.
zh: 我們歡迎貢獻！請查看我們的 GitHub 存儲庫以了解貢獻指南和開放的問題。

# question_8
source: Is there support for database migrations with MongoDB?
de: Gibt es eine Community oder ein Forum für Unterstützung?
it: Esiste una comunità o un forum per il supporto?
zh: 是否有社區或論壇提供支持？

# answer_8
source: Yes, the kit includes tools and guidelines for managing MongoDB schema changes and data migrations to ensure smooth database evolution.
de: Obwohl wir kein eigenes Forum haben, können Sie GitHub Issues für Fragen und Diskussionen nutzen.
it: Anche se non abbiamo un forum dedicato, puoi utilizzare le Issues di GitHub per domande e discussioni.
zh: 雖然我們沒有專門的論壇，但您可以使用 GitHub 問題來提問和討論。

# privacy_policy_title
source: Privacy Policy
de: Datenschutzerklärung
it: Informativa sulla privacy
zh: 隱私政策

# privacy_policy_description
source: Full-Stack Flask Starter Kit's Privacy Policy outlines how we collect, use, and protect your data. Learn about our commitment to your privacy and data security, including our handling of authentication information.
de: Die Datenschutzerklärung des Full-Stack Flask Starter Kit erläutert, wie wir Ihre Daten sammeln, verwenden und schützen. Erfahren Sie mehr über unser Engagement für Ihre Privatsphäre und Datensicherheit.
it: L'Informativa sulla privacy del Full-Stack Flask Starter Kit illustra come raccogliamo, utilizziamo e proteggiamo i tuoi dati. Scopri il nostro impegno per la tua privacy e la sicurezza dei dati.
zh: 全棧 Flask 入門套件的隱私政策概述了我們如何收集、使用和保護您的數據。了解我們對您的隱私和數據安全的承諾。

source: English only
de: Nur auf Englisch
it: Solo in inglese
zh: 僅提供英文版本

# terms_and_conditions_title
source: Terms & Conditions
de: Allgemeine Geschäftsbedingungen
it: Termini e Condizioni
zh: 條款和條件

# terms_and_conditions_description
source: Read the Full-Stack Flask Starter Kit's Terms and Conditions. Understand your rights and responsibilities when using our Flask development toolkit, including guidelines for authentication and data usage.
de: Lesen Sie die Allgemeinen Geschäftsbedingungen des Full-Stack Flask Starter Kit. Verstehen Sie Ihre Rechte und Pflichten bei der Nutzung unseres Flask-Entwicklungs-Toolkits.
it: Leggi i Termini e le Condizioni del Full-Stack Flask Starter Kit. Comprendi i tuoi diritti e responsabilità quando usi il nostro toolkit di sviluppo Flask.
zh: 閱讀全棧 Flask 入門套件的條款和條件。了解使用我們的 Flask 開發工具包時的權利和責任。

source: Home
de: Startseite
zh: 首頁

# home_hero_heading
source: Full-Stack Flask Starter Kit
zh: 全棧 Flask 入門套件
